In [1]:
import pandas as pd
import numpy as np

In [2]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from openpyxl) (1.1.0)

WARNING: You are using pip version 22.0.3; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\admin\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

1) Задание: загрузить данные из файлов (приложены к письму):
* excel-comp-data.xlsx
* sp500hst.txt

2) Загрузить данные из файла sp500hst.txt, обозначить столбцы (в соответствии с содержимым).

In [2]:
dataframe = pd.read_csv("data/sp500hst.txt", delimiter=',', names=["date", "ticker", "open", "high", "low", "close", "volume"])
dataframe

            date ticker   open     high     low  close  volume
0       20090821      A  25.60  25.6100  25.220  25.55   34758
1       20090824      A  25.64  25.7400  25.330  25.50   22247
2       20090825      A  25.50  25.7000  25.225  25.34   30891
3       20090826      A  25.32  25.6425  25.145  25.48   33334
4       20090827      A  25.50  25.5700  25.230  25.54   70176
...          ...    ...    ...      ...     ...    ...     ...
122569  20100813    ZMH  51.72  51.9000  51.380  51.44   14561
122570  20100816    ZMH  51.13  51.4700  50.600  51.00   13489
122571  20100817    ZMH  51.14  51.6000  50.890  51.21   20498
122572  20100819    ZMH  51.63  51.6300  50.170  50.22   18259
122573  20100820    ZMH  50.03  50.5500  49.480  49.82   17792

[122574 rows x 7 columns]

In [3]:
dataframe['date'] = pd.to_datetime(dataframe['date'].astype(str), format="%Y%m%d")
dataframe

             date ticker   open     high     low  close  volume
0      2009-08-21      A  25.60  25.6100  25.220  25.55   34758
1      2009-08-24      A  25.64  25.7400  25.330  25.50   22247
2      2009-08-25      A  25.50  25.7000  25.225  25.34   30891
3      2009-08-26      A  25.32  25.6425  25.145  25.48   33334
4      2009-08-27      A  25.50  25.5700  25.230  25.54   70176
...           ...    ...    ...      ...     ...    ...     ...
122569 2010-08-13    ZMH  51.72  51.9000  51.380  51.44   14561
122570 2010-08-16    ZMH  51.13  51.4700  50.600  51.00   13489
122571 2010-08-17    ZMH  51.14  51.6000  50.890  51.21   20498
122572 2010-08-19    ZMH  51.63  51.6300  50.170  50.22   18259
122573 2010-08-20    ZMH  50.03  50.5500  49.480  49.82   17792

[122574 rows x 7 columns]

In [4]:
dataframe_excel = pd.read_excel("data/excel-comp-data.xlsx")
dataframe_excel

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

3.1) Создать столбец со значениями, средними между значением дневного минимума и максимума.

In [5]:
dataframe["Mean"] = dataframe[["high", "low"]].mean(axis=1)
dataframe

             date ticker   open     high     low  close  volume      Mean
0      2009-08-21      A  25.60  25.6100  25.220  25.55   34758  25.41500
1      2009-08-24      A  25.64  25.7400  25.330  25.50   22247  25.53500
2      2009-08-25      A  25.50  25.7000  25.225  25.34   30891  25.46250
3      2009-08-26      A  25.32  25.6425  25.145  25.48   33334  25.39375
4      2009-08-27      A  25.50  25.5700  25.230  25.54   70176  25.40000
...           ...    ...    ...      ...     ...    ...     ...       ...
122569 2010-08-13    ZMH  51.72  51.9000  51.380  51.44   14561  51.64000
122570 2010-08-16    ZMH  51.13  51.4700  50.600  51.00   13489  51.03500
122571 2010-08-17    ZMH  51.14  51.6000  50.890  51.21   20498  51.24500
122572 2010-08-19    ZMH  51.63  51.6300  50.170  50.22   18259  50.90000
122573 2010-08-20    ZMH  50.03  50.5500  49.480  49.82   17792  50.01500

[122574 rows x 8 columns]

3.2) Рассчитать среднее значение показателей для каждого из столбцов 3-6.

In [6]:
print(dataframe[['open','high','low','close']].mean())

open     42.595458
high     43.102243
low      42.054464
close    42.601865
dtype: float64

4.1) Создать DataFrame состоящий из строк относящихся только к 13 августа 2010 года.

In [7]:
dataframe_13082010 = dataframe[dataframe["date"] == "2010-08-13"]
dataframe_13082010

             date ticker    open      high      low   close  volume       Mean
240    2010-08-13      A   27.39   27.8500   27.300   27.35   24469   27.57500
485    2010-08-13     AA   10.70   10.7900   10.575   10.64  154397   10.68250
726    2010-08-13   AAPL  251.03  251.8800  249.090  249.10  126738  250.48500
971    2010-08-13    ABC   29.01   29.1300   28.690   29.04   16196   28.91000
1216   2010-08-13    ABT   50.13   50.2600   49.910   50.06   50879   50.08500
...           ...    ...     ...       ...      ...     ...     ...        ...
121385 2010-08-13    XRX    9.05    9.2200    8.980    9.01   89064    9.10000
121835 2010-08-13   YHOO   13.82   13.9550   13.760   13.83   78455   13.85750
122080 2010-08-13    YUM   40.80   41.0399   40.620   40.85   20055   40.82995
122324 2010-08-13   ZION   20.17   20.4300   19.840   19.89   25193   20.13500
122569 2010-08-13    ZMH   51.72   51.9000   51.380   51.44   14561   51.64000

[499 rows x 8 columns]

4.1.2) Из DataFrame, созданного в 4.1, cоздать серию из 30 первых имен

In [8]:
dataframe_series = pd.Series(dataframe_13082010['ticker'][:30])
dataframe_series

240        A
485       AA
726     AAPL
971      ABC
1216     ABT
1273     ACE
1626    ADBE
1871     ADI
2116     ADM
2359     ADP
2601    ADSK
2846     AEE
3091     AEP
3336     AES
3581     AET
3826     AFL
4071     AGN
4316     AIG
4561     AIV
4806     AIZ
5049    AKAM
5294     AKS
5539     ALL
5782    ALTR
6025    AMAT
6270     AMD
6514    AMGN
6758     AMP
7003     AMT
7246    AMZN
Name: ticker, dtype: object

4.2) Из DataFrame, созданного в 4.1, создать новый DataFrame индексом в котором являются имена тикеров.

In [9]:
dataframe_tickers = dataframe_13082010.set_index(dataframe_13082010['ticker'])
dataframe_tickers

             date ticker    open      high      low   close  volume       Mean
ticker
A      2010-08-13      A   27.39   27.8500   27.300   27.35   24469   27.57500
AA     2010-08-13     AA   10.70   10.7900   10.575   10.64  154397   10.68250
AAPL   2010-08-13   AAPL  251.03  251.8800  249.090  249.10  126738  250.48500
ABC    2010-08-13    ABC   29.01   29.1300   28.690   29.04   16196   28.91000
ABT    2010-08-13    ABT   50.13   50.2600   49.910   50.06   50879   50.08500
...           ...    ...     ...       ...      ...     ...     ...        ...
XRX    2010-08-13    XRX    9.05    9.2200    8.980    9.01   89064    9.10000
YHOO   2010-08-13   YHOO   13.82   13.9550   13.760   13.83   78455   13.85750
YUM    2010-08-13    YUM   40.80   41.0399   40.620   40.85   20055   40.82995
ZION   2010-08-13   ZION   20.17   20.4300   19.840   19.89   25193   20.13500
ZMH    2010-08-13    ZMH   51.72   51.9000   51.380   51.44   14561   51.64000

[499 rows x 8 columns]

4.3) Создать DataFrame состоящий из строк относящихся только тикеру ALTR.

In [10]:
ALTR_dataframe = dataframe[dataframe['ticker'] == "ALTR"]
ALTR_dataframe

           date ticker   open   high    low  close  volume    Mean
5544 2009-08-21   ALTR  19.36  19.50  19.15  19.48   54580  19.325
5545 2009-08-24   ALTR  19.51  19.72  19.04  19.13   42059  19.380
5546 2009-08-25   ALTR  19.13  19.39  18.95  19.05   48539  19.170
5547 2009-08-26   ALTR  19.11  19.41  18.99  19.28   42058  19.200
5548 2009-08-27   ALTR  19.23  19.32  18.88  19.08   63271  19.100
...         ...    ...    ...    ...    ...    ...     ...     ...
5782 2010-08-13   ALTR  25.30  25.50  24.94  24.94   69416  25.220
5783 2010-08-16   ALTR  24.82  25.31  24.53  25.11   60276  24.920
5784 2010-08-17   ALTR  25.22  25.88  25.04  25.54   89329  25.460
5785 2010-08-19   ALTR  25.61  25.96  25.24  25.50   61815  25.600
5786 2010-08-20   ALTR  25.44  25.83  25.32  25.60   54383  25.575

[243 rows x 8 columns]

4.4) Из DataFrame, созданного в 4.3, создать DataFrame индексом в котором являются даты.

In [11]:
dataframe_index_date = ALTR_dataframe.set_index(ALTR_dataframe['date'])
dataframe_index_date

                 date ticker   open   high    low  close  volume    Mean
date
2009-08-21 2009-08-21   ALTR  19.36  19.50  19.15  19.48   54580  19.325
2009-08-24 2009-08-24   ALTR  19.51  19.72  19.04  19.13   42059  19.380
2009-08-25 2009-08-25   ALTR  19.13  19.39  18.95  19.05   48539  19.170
2009-08-26 2009-08-26   ALTR  19.11  19.41  18.99  19.28   42058  19.200
2009-08-27 2009-08-27   ALTR  19.23  19.32  18.88  19.08   63271  19.100
...               ...    ...    ...    ...    ...    ...     ...     ...
2010-08-13 2010-08-13   ALTR  25.30  25.50  24.94  24.94   69416  25.220
2010-08-16 2010-08-16   ALTR  24.82  25.31  24.53  25.11   60276  24.920
2010-08-17 2010-08-17   ALTR  25.22  25.88  25.04  25.54   89329  25.460
2010-08-19 2010-08-19   ALTR  25.61  25.96  25.24  25.50   61815  25.600
2010-08-20 2010-08-20   ALTR  25.44  25.83  25.32  25.60   54383  25.575

[243 rows x 8 columns]

4.5) В DataFrame, созданном в 4.3, добавить столбец, содержащий только число месяца, к которому относится дата.

In [12]:
ALTR_dataframe["month"] = ALTR_dataframe['date'].dt.month
ALTR_dataframe

C:\Users\admin\AppData\Local\Temp\ipykernel_13180\1325914781.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ALTR_dataframe["month"] = ALTR_dataframe['date'].dt.month

           date ticker   open   high    low  close  volume    Mean  month
5544 2009-08-21   ALTR  19.36  19.50  19.15  19.48   54580  19.325      8
5545 2009-08-24   ALTR  19.51  19.72  19.04  19.13   42059  19.380      8
5546 2009-08-25   ALTR  19.13  19.39  18.95  19.05   48539  19.170      8
5547 2009-08-26   ALTR  19.11  19.41  18.99  19.28   42058  19.200      8
5548 2009-08-27   ALTR  19.23  19.32  18.88  19.08   63271  19.100      8
...         ...    ...    ...    ...    ...    ...     ...     ...    ...
5782 2010-08-13   ALTR  25.30  25.50  24.94  24.94   69416  25.220      8
5783 2010-08-16   ALTR  24.82  25.31  24.53  25.11   60276  24.920      8
5784 2010-08-17   ALTR  25.22  25.88  25.04  25.54   89329  25.460      8
5785 2010-08-19   ALTR  25.61  25.96  25.24  25.50   61815  25.600      8
5786 2010-08-20   ALTR  25.44  25.83  25.32  25.60   54383  25.575      8

[243 rows x 9 columns]

4.5.1) Создать DataFrame состоящий из строк относящихся только тикеру WAT и объединить его с DataFrame для ALTR.

In [13]:
WAT_dataframe = dataframe[dataframe["ticker"] == "WAT"]
WAT_dataframe

             date ticker   open    high    low  close  volume    Mean
115246 2009-08-21    WAT  50.77  52.144  50.33  51.80    9785  51.237
115247 2009-08-24    WAT  52.02  52.020  51.38  51.48    5866  51.700
115248 2009-08-25    WAT  51.61  52.740  51.50  52.23    9567  52.120
115249 2009-08-26    WAT  51.94  52.860  51.93  52.17    4202  52.395
115250 2009-08-27    WAT  52.09  52.220  51.33  51.73    6473  51.775
...           ...    ...    ...     ...    ...    ...     ...     ...
115486 2010-08-13    WAT  62.84  63.320  62.35  62.39   11458  62.835
115487 2010-08-16    WAT  62.00  62.360  61.46  61.95   12828  61.910
115488 2010-08-17    WAT  62.74  64.790  62.56  64.43    9557  63.675
115489 2010-08-19    WAT  64.10  64.380  62.43  62.53    8350  63.405
115490 2010-08-20    WAT  61.99  62.730  61.44  62.68    9270  62.085

[245 rows x 8 columns]

In [14]:
ALTR_WAT_dataframe = pd.merge(left=ALTR_dataframe, right=WAT_dataframe, left_on='date', right_on='date')
ALTR_WAT_dataframe

,date,ticker_x,open_x,high_x,low_x,close_x,volume_x,Mean_x,month,ticker_y,open_y,high_y,low_y,close_y,volume_y,Mean_y
0,2009-08-21,ALTR,19.36,19.50,19.15,19.48,54580,19.325,8,WAT,50.77,52.144,50.33,51.80,9785,51.237
1,2009-08-24,ALTR,19.51,19.72,19.04,19.13,42059,19.380,8,WAT,52.02,52.020,51.38,51.48,5866,51.700
2,2009-08-25,ALTR,19.13,19.39,18.95,19.05,48539,19.170,8,WAT,51.61,52.740,51.50,52.23,9567,52.120
3,2009-08-26,ALTR,19.11,19.41,18.99,19.28,42058,19.200,8,WAT,51.94,52.860,51.93,52.17,4202,52.395
4,2009-08-27,ALTR,19.23,19.32,18.88,19.08,63271,19.100,8,WAT,52.09,52.220,51.33,51.73,6473,51.775
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
238,2010-08-13,ALTR,25.30,25.50,24.94,24.94,69416,25.220,8,WAT,62.84,63.320,62.35,62.39,11458,62.835
239,2010-08-16,ALTR,24.82,25.31,24.53,25.11,60276,24.920,8,WAT,62.00,62.360,61.46,61.95,12828,61.910
240,2010-08-17,ALTR,25.22,25.88,25.04,25.54,89329,25.460,8,WAT,62.74,64.790,62.56,64.43,9557,63.675
241,2010-08-19,ALTR,25.61,25.96,25.24,25.50,61815,25.600,8,WAT,64.10,64.380,62.43,62.53,8350,63.405
242,2010-08-20,ALTR,25.44,25.83,25.32,25.60,54383,25.575,8,WAT,61.99,62.730,61.44,62.68,9270,62.085

4.5.2) Создать DataFrame в котором присутствует столбец, отражающий разницу в объёмах торгов по WAT и ALTR в одинаковые дни и содержит исходные данные об объёме торгов этими акциями.

In [15]:
volume_diff_dataframe = ALTR_WAT_dataframe[["ticker_x", "ticker_y", "date", "volume_x", "volume_y"]]
volume_diff_dataframe['volume_diff'] = ALTR_WAT_dataframe['volume_x'] - ALTR_WAT_dataframe['volume_y']
volume_diff_dataframe

C:\Users\admin\AppData\Local\Temp\ipykernel_13180\1689692123.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  volume_diff_dataframe['volume_diff'] = ALTR_WAT_dataframe['volume_x'] - ALTR_WAT_dataframe['volume_y']

    ticker_x ticker_y       date  volume_x  volume_y  volume_diff
0       ALTR      WAT 2009-08-21     54580      9785        44795
1       ALTR      WAT 2009-08-24     42059      5866        36193
2       ALTR      WAT 2009-08-25     48539      9567        38972
3       ALTR      WAT 2009-08-26     42058      4202        37856
4       ALTR      WAT 2009-08-27     63271      6473        56798
..       ...      ...        ...       ...       ...          ...
238     ALTR      WAT 2010-08-13     69416     11458        57958
239     ALTR      WAT 2010-08-16     60276     12828        47448
240     ALTR      WAT 2010-08-17     89329      9557        79772
241     ALTR      WAT 2010-08-19     61815      8350        53465
242     ALTR      WAT 2010-08-20     54383      9270        45113

[243 rows x 6 columns]

4.6) В DataFrame добавить столбец, содержащий только число месяца, к которому относится дата.

In [16]:
dataframe['month_date'] = dataframe['date'].dt.month
dataframe

,date,ticker,open,high,low,close,volume,Mean,month_date
0,2009-08-21,A,25.60,25.6100,25.220,25.55,34758,25.41500,8
1,2009-08-24,A,25.64,25.7400,25.330,25.50,22247,25.53500,8
2,2009-08-25,A,25.50,25.7000,25.225,25.34,30891,25.46250,8
3,2009-08-26,A,25.32,25.6425,25.145,25.48,33334,25.39375,8
4,2009-08-27,A,25.50,25.5700,25.230,25.54,70176,25.40000,8
...,...,...,...,...,...,...,...,...,...
122569,2010-08-13,ZMH,51.72,51.9000,51.380,51.44,14561,51.64000,8
122570,2010-08-16,ZMH,51.13,51.4700,50.600,51.00,13489,51.03500,8
122571,2010-08-17,ZMH,51.14,51.6000,50.890,51.21,20498,51.24500,8
122572,2010-08-19,ZMH,51.63,51.6300,50.170,50.22,18259,50.90000,8
122573,2010-08-20,ZMH,50.03,50.5500,49.480,49.82,17792,50.01500,8

4.7) Из DataFrame выбрать только строки, относящиеся к 13 числу месяца.

In [17]:
dataframe['day_date'] = dataframe['date'].dt.day
dataframe[dataframe['day_date'] == 13]

,date,ticker,open,high,low,close,volume,Mean,month_date,day_date
35,2009-10-13,A,27.41,27.53,27.150,27.29,14226,27.340,10,13
53,2009-11-13,A,27.97,28.89,27.750,28.61,62633,28.320,11,13
93,2010-01-13,A,30.47,30.78,30.050,30.69,24455,30.415,1,13
154,2010-04-13,A,34.15,34.23,33.880,33.90,25868,34.055,4,13
176,2010-05-13,A,34.83,35.29,34.430,34.78,43992,34.860,5,13
...,...,...,...,...,...,...,...,...,...,...
122422,2010-01-13,ZMH,62.26,62.79,61.732,62.55,7663,62.261,1,13
122483,2010-04-13,ZMH,59.27,60.15,59.060,60.09,13177,59.605,4,13
122505,2010-05-13,ZMH,60.97,61.20,60.650,60.65,10647,60.925,5,13
122546,2010-07-13,ZMH,56.38,57.57,56.380,56.92,21035,56.975,7,13
122569,2010-08-13,ZMH,51.72,51.90,51.380,51.44,14561,51.640,8,13

4) Выявить столбцы, содержащие минимальные и максимальные значения (если такие столбцы есть). (Проверить, есть ли среди столбцов, столбец с минимальным значением курса акций.)

In [55]:
print("Получившийся датафрейм из минимальных и максимальных значений:")
dataframe.describe().loc[['min', 'max']]

Получившийся датафрейм из минимальных и максимальных значений:

       open    high     low   close      volume     Mean  month_date  day_date
min    1.36    1.39    1.00    1.35        47.0    1.365         1.0       1.0
max  627.84  629.51  624.24  626.75  21474836.0  626.875        12.0      31.0

5) По данным из 'sp500hst.txt' при помощи Pandas расчитать максимальные значения в 3-6 столбца для дат после 20100801

In [30]:
dataframe[dataframe['date'] > "2010-08-01"]

,date,ticker,open,high,low,close,volume,Mean,month_date,day_date
231,2010-08-02,A,28.35,28.97,28.20,28.82,28989,28.585,8,2
232,2010-08-03,A,28.70,28.73,27.80,27.84,42401,28.265,8,3
233,2010-08-04,A,27.86,28.35,27.75,28.29,23525,28.050,8,4
234,2010-08-05,A,28.03,28.63,27.96,28.46,20682,28.295,8,5
235,2010-08-06,A,28.18,28.75,28.07,28.73,33777,28.410,8,6
...,...,...,...,...,...,...,...,...,...,...
122569,2010-08-13,ZMH,51.72,51.90,51.38,51.44,14561,51.640,8,13
122570,2010-08-16,ZMH,51.13,51.47,50.60,51.00,13489,51.035,8,16
122571,2010-08-17,ZMH,51.14,51.60,50.89,51.21,20498,51.245,8,17
122572,2010-08-19,ZMH,51.63,51.63,50.17,50.22,18259,50.900,8,19
122573,2010-08-20,ZMH,50.03,50.55,49.48,49.82,17792,50.015,8,20

In [31]:
dataframe[dataframe['date'] > "2010-08-01"].max()[['open', 'high', 'low', 'close']]

open      505.85
high       508.6
low      503.559
close      508.1
dtype: object

6) По данным из 'sp500hst.txt' при помощи Pandas расчитать средний объем торгов (обеъм торгов - в последнем столбце) при значениях 3го столбца больше 50.

In [32]:
dataframe[dataframe['open'] > 50].mean(numeric_only=True)[['volume']]

volume    36467.086646
dtype: float64

7) Добавить столбец с расшифровкой названия тикера используя данные из файла sp_data2.csv . В случае нехватки данных об именах тикеров корректно обработать их.

In [33]:
dataframe_spdata2 = pd.read_csv("data/sp_data2.csv", delimiter=';', names=['ticker', 'ticker_name', 'percent'])
dataframe_spdata2

    ticker      ticker_name percent
0     AAPL            Apple    3.6%
1     AMZN       Amazon.com    3.2%
2    GOOGL         Alphabet    3.1%
3     GOOG         Alphabet    3.1%
4     MSFT        Microsoft    3.0%
..     ...              ...     ...
500    SCG            SCANA    0.0%
501    AIZ         Assurant    0.0%
502    AYI    Acuity Brands    0.0%
503    HRB        H&R Block    0.0%
504    RRC  Range Resources    0.0%

[505 rows x 3 columns]

In [65]:
dataframe_with_name_ticker = pd.merge(dataframe, dataframe_spdata2, on='ticker', how='outer')
dataframe_with_name_ticker

,date,ticker,open,high,low,close,volume,Mean,month_date,day_date,ticker_name,percent
0,2009-08-21,A,25.60,25.6100,25.220,25.55,34758.0,25.41500,8.0,21.0,Agilent Technologies,0.1%
1,2009-08-24,A,25.64,25.7400,25.330,25.50,22247.0,25.53500,8.0,24.0,Agilent Technologies,0.1%
2,2009-08-25,A,25.50,25.7000,25.225,25.34,30891.0,25.46250,8.0,25.0,Agilent Technologies,0.1%
3,2009-08-26,A,25.32,25.6425,25.145,25.48,33334.0,25.39375,8.0,26.0,Agilent Technologies,0.1%
4,2009-08-27,A,25.50,25.5700,25.230,25.54,70176.0,25.40000,8.0,27.0,Agilent Technologies,0.1%
...,...,...,...,...,...,...,...,...,...,...,...,...
122732,NaT,FL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Foot Locker,0.0%
122733,NaT,NFX,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Newfield Exploration,0.0%
122734,NaT,EVHC,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Envision Healthcare,0.0%
122735,NaT,BHF,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Brighthouse Financial,0.0%
122736,NaT,AYI,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Acuity Brands,0.0%

8) Вывести тикеры, для которых не были найдены расшифровки.

In [77]:
print("Тикеры, не имеющие полной расшифровки:")
dataframe_ticker_name = dataframe_with_name_ticker[['ticker', 'ticker_name']]
dataframe_ticker_name_is = dataframe_ticker_name[dataframe_ticker_name['ticker_name'].isnull()]
dataframe_ticker_name_is_null = dataframe_ticker_name_is.drop_duplicates(keep="first")
dataframe_ticker_name_is_null['ticker']

Тикеры, не имеющие полной расшифровки:

245         AA
1221       ACE
1278       ACS
5054       AKS
5544      ALTR
          ...
119201     WYN
119683       X
121390     XTO
121597    YHOO
122329     ZMH
Name: ticker, Length: 182, dtype: object

9) Рассчитать суммарный объем торгов (столбец 7) для одинаковых значений (тикеров) из столбца 2

In [36]:
dataframe_with_name_ticker.groupby("ticker")['volume'].sum()

ticker
A        8609336
AAPL    52261170
ABC      9006756
ABT     18975870
ADBE    17422423
          ...
XOM     66633788
XRAY     2709860
XRX     41236860
YUM     10971538
ZION    15551119
Name: volume, Length: 342, dtype: int64

9.2) Для каждого тикера подсчитать, сколько раз он встречается.

In [37]:
dataframe_with_name_ticker.groupby('ticker')['ticker'].count()

ticker
A       245
AAPL    241
ABC     245
ABT     245
ADBE    243
       ...
XOM     245
XRAY    239
XRX     245
YUM     245
ZION    244
Name: ticker, Length: 342, dtype: int64

10) Расчитать среднее значение показателей для каждого из столбцов 3-6 для одинаковых значений (тикеров) из столбца 2 и сохранить в новом DataFrame

In [38]:
dataframe_with_name_ticker_copy = dataframe_with_name_ticker.copy()
dataframe_with_name_ticker_copy = dataframe_with_name_ticker_copy.groupby('ticker')[['open', 'high', 'low', 'close']].mean()
dataframe_with_name_ticker_copy

              open        high         low       close
ticker
A        30.234857   30.567838   29.866467   30.246143
AAPL    221.342427  223.556147  218.409411  221.125341
ABC      27.432122   27.683660   27.126983   27.429347
ABT      50.996776   51.365541   50.555472   50.986490
ADBE     33.357181   33.741407   32.936090   33.352469
...            ...         ...         ...         ...
XOM      66.675041   67.140401   66.092481   66.622347
XRAY     33.630628   33.958713   33.295432   33.650335
XRX       8.978078    9.109051    8.832747    8.978173
YUM      37.456898   37.816882   37.094593   37.479633
ZION     19.694057   20.171136   19.226905   19.702861

[342 rows x 4 columns]

11) Добавить в DataFrame новый столбец, содержащий объем торгов (столбец 7), нормированный по среднему значению объема торгов для данного тикера.

In [39]:
dataframe_with_name_ticker['volume_norm'] = dataframe_with_name_ticker.groupby('ticker')['volume'].transform(lambda vol: vol / vol.mean())
dataframe_with_name_ticker

,date,ticker,open,high,low,close,volume,Mean,month_date,day_date,ticker_name,percent,volume_norm
0,2009-08-21,A,25.60,25.6100,25.220,25.55,34758,25.41500,8,21,Agilent Technologies,0.1%,0.989125
1,2009-08-24,A,25.64,25.7400,25.330,25.50,22247,25.53500,8,24,Agilent Technologies,0.1%,0.633094
2,2009-08-25,A,25.50,25.7000,25.225,25.34,30891,25.46250,8,25,Agilent Technologies,0.1%,0.879080
3,2009-08-26,A,25.32,25.6425,25.145,25.48,33334,25.39375,8,26,Agilent Technologies,0.1%,0.948602
4,2009-08-27,A,25.50,25.5700,25.230,25.54,70176,25.40000,8,27,Agilent Technologies,0.1%,1.997032
...,...,...,...,...,...,...,...,...,...,...,...,...,...
82167,2010-08-13,ZION,20.17,20.4300,19.840,19.89,25193,20.13500,8,13,Zions Bancorp,0.0%,0.395283
82168,2010-08-16,ZION,19.81,19.9600,19.600,19.95,25914,19.78000,8,16,Zions Bancorp,0.0%,0.406596
82169,2010-08-17,ZION,20.07,20.4700,19.830,20.31,31717,20.15000,8,17,Zions Bancorp,0.0%,0.497646
82170,2010-08-19,ZION,19.83,20.0000,19.130,19.35,45935,19.56500,8,19,Zions Bancorp,0.0%,0.720729
82171,2010-08-20,ZION,19.15,19.2700,18.810,19.14,37225,19.04000,8,20,Zions Bancorp,0.0%,0.584067